In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('Resources/MAIN_country_happ_temp_water.csv')
df

          Country  Year  Life Ladder  Temperature  Clean Water
0     Afghanistan  2010        4.758       14.629     48.28708
1     Afghanistan  2011        3.832       16.487     50.82785
2     Afghanistan  2012        3.783       14.373     53.40352
3     Afghanistan  2013        3.572       16.156     56.01404
4     Afghanistan  2014        3.131       15.647     58.65937
...           ...   ...          ...          ...          ...
1095     Zimbabwe  2016        3.735       22.488     64.46896
1096     Zimbabwe  2017        3.638       22.735     63.99662
1097     Zimbabwe  2018        3.616       22.550     63.53877
1098     Zimbabwe  2019        2.694       22.338     63.09496
1099     Zimbabwe  2021        3.145          NaN          NaN

[1100 rows x 5 columns]

In [26]:
df2 = pd.read_csv('Resources/greenhouse_gasses.csv')
greenhouse_gasses = df2.melt(id_vars=["Country Name"], 
        var_name="Date", 
        value_name="Value")
greenhouse_gasses.sort_values(by='Country Name', ascending=True)

     Country Name  Date    Value
1598  Afghanistan  2016  95370.0
1332  Afghanistan  2015  93730.0
2     Afghanistan  2010  44910.0
800   Afghanistan  2013  74800.0
2662  Afghanistan  2020      NaN
...           ...   ...      ...
1329     Zimbabwe  2014  29350.0
1595     Zimbabwe  2015  31280.0
2393     Zimbabwe  2018  31380.0
1861     Zimbabwe  2016  29120.0
2925     Zimbabwe  2020      NaN

[2926 rows x 3 columns]